blockCase/constant/tubes/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

species         
( 
        CO2
        CH4
);

CO2
{
    specie
    {
        //nMoles       1;
        molWeight   44;
        //Y           0.5;
    }
    thermodynamics
    {
        Cp          500;
        Hf          0;
    }
    transport
    {
        mu          1.67212e-06;
        Pr          0.7;
    }
    
}

CH4
{
    specie
    {
        //nMoles       1;
        molWeight   16;
        //Y           0.5;
    }
    thermodynamics
    {
        Cp          500;
        Hf          0;
    }
    transport
    {
        mu          1.5e-6;
        Pr          0.7;
    }
}


inertSpecie     CH4;


// ************************************************************************* //
