blockCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
   ( 1 0 1 )//0
   ( 1 0 -1 )//1
   ( 1 1 1 )//2
   ( 1 1 -1 )//3
   ( -1 0 1 )//4
   ( -1 0 -1 )//5
   ( -1 1 1 )//6
   ( -1 1 -1 )//7
   
);

blocks
(
    hex (1 3 7 5 0 2 6 4) (10 10 10) simpleGrading (1 1 1)
);

edges
(
);
boundary
(
   inlet
    {
        type patch;
        faces
        (
            (2 6 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 3 1 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 3 2 0)
            (7 5 4 6)
        );
    }
    upAndDown
    {
        type empty;
        faces
        (
            (7 6 2 3)
            (5 1 0 4)
        );
    }
 
);

mergePatchPairs
(
);

// ************************************************************************* //
