blockCase/system/shell/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue CH4   1
    volScalarFieldValue CO2   0
);

regions
(
    boxToCell
    {
        box (-1 0 -1) (1 1 1);
        fieldValues
        (
            volScalarFieldValue CH4    1
            volScalarFieldValue CO2    0
        );
    }
);


// ************************************************************************* //
