blockCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // tubes
    {
        name    tubesCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 -1) (1 1 1);
        }

    }
    {
        name    tubes;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;

        set     tubesCellSet;
    }

    // shell
    {
        name    shellCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1 0 -1) (0 1 1);
        }
    }
    {
        name    shell;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;

        set     shellCellSet;
    }

);


// ************************************************************************* //
